In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame(
        {"a" : [4, 5, 6],
        "b" : [7, 8, 9],
        "c" : [10, 11, 12]},
        index = [1, 2, 3])

In [3]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [4]:
# column data
df["a"]

1    4
2    5
3    6
Name: a, dtype: int64

In [5]:
# 여러 개의 column
df[["a", "c"]]

   a   c
1  4  10
2  5  11
3  6  12

In [6]:
# row data 보기
df.loc[3]

a     6
b     9
c    12
Name: 3, dtype: int64

In [7]:
# column과 row data (행, 열 순으로 적어주기)
df.loc[3, "a"]

6

In [8]:
# 여러 개의 column과 row data (행, 열 순으로 적어주기)
df.loc[[1,2], ["a", "b"]]

   a  b
1  4  7
2  5  8

In [9]:
# column 명을 별도로 지정 가능
df = pd.DataFrame(
        [[4, 7, 10],
        [5, 8, 11],
        [6, 9, 12]],
        index=[1, 2, 3],
        columns=['a', 'b', 'c'])

In [10]:
df

   a  b   c
1  4  7  10
2  5  8  11
3  6  9  12

In [11]:
# tuple를 이용하여 DataFrame 생성 방법
df = pd.DataFrame(
    {"a" : [4 ,5, 6],
    "b" : [7, 8, 9],
    "c" : [10, 11, 12]},
    index = pd.MultiIndex.from_tuples(
    [('d', 1), ('d', 2), ('e', 2)],
    names=['n', 'v']))

In [12]:
df

     a  b   c
n v
d 1  4  7  10
  2  5  8  11
e 2  6  9  12